app/views/events/_form.html.erb

SELECT  "businessowners".* FROM "businessowners" WHERE "businessowners"."id" = ?  ORDER BY "businessowners"."id" ASC LIMIT 1  [["id", 1]]
---
  </div>
  <% if Businessowner.where(id:session[:user_id]).first.role=="Admin" && !@event.is_approved && @event.id!=nil%>