app/controllers/businessowners_controller.rb

  def index
    @businessowners = Businessowner.all
---
SELECT "businessowners".* FROM "businessowners"

  def create

    puts "----------check for the count------------"
    puts Businessowner.where(email: params[:businessowner][:email]).count
    #check if email already registered, reject if yes and redirect to register page with warning
    respond_to do |format|

      if Businessowner.where(email: params[:businessowner][:email]).count > 0
        errors = 'The account with provided email already exists.'
        flash[:error] = errors

        format.html { redirect_to "/account/register"  }
        format.json { render :show, status: :created, location: @businessowner }
      else
        @businessowner = Businessowner.new(businessowner_params)
        @businessowner.role = "Company" # to distinguish between admin and normal company user. set admin from database
        if @businessowner.save
---
SELECT COUNT(*) FROM "businessowners" WHERE "businessowners"."email" = ?  [["email", "y.mohit2316abcd@gmail.com"]]
INSERT INTO "businessowners" ("company_name", "email", "password", "company_website", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["company_name", "ui"], ["email", ""], ["password", ""], ["company_website", ""], ["phone", ""], ["created_at", "2015-02-23 02:21:41.428664"], ["updated_at", "2015-02-23 02:21:41.428664"]]

  def validate
    @businessowner = Businessowner.where("email =? and password =? ",params[:businessowner][:email], params[:businessowner][:password])
---
SELECT "businessowners".* FROM "businessowners" WHERE (email ='y.mohit2316@gmail.com' and password ='webmail12q1212343' )

    def set_businessowner
      @businessowner = Businessowner.find(params[:id])
---
SELECT  "businessowners".* FROM "businessowners" WHERE "businessowners"."id" = ? LIMIT 1  [["id", 1]]