app/controllers/dashboards_controller.rb

  def index
  	if get_current_user!= nil
  		@events = Event.where(businessowner_id:session[:user_id])
---
SELECT "events".* FROM "events" WHERE "events"."businessowner_id" = ?  [["businessowner_id", 1]]

  def admin
    if get_current_user!= nil && get_current_user.role =="Admin"
      @events = Event.where(is_approved:nil)
---
SELECT "events".* FROM "events" WHERE "events"."is_approved" IS NULL

  def approved
    if get_current_user!= nil && get_current_user.role =="Admin"
      @events = Event.where(is_approved:true)
---
SELECT "events".* FROM "events" WHERE "events"."is_approved" = 't'

  def detail
  	# @event = Event.find(params[:id])
  	@event = Event.where(businessowner_id:session[:user_id]).first
---
SELECT  "events".* FROM "events" WHERE "events"."businessowner_id" = ?  ORDER BY "events"."id" ASC LIMIT 1  [["businessowner_id", 1]]