app/controllers/events_controller.rb

  def create
    if(params[:event][:source]=='facebook')
      @event = Event.new(get_event_info_facebook)
    else
      @event = Event.new(event_params)
    end
    @event.is_approved = false
    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("name", "description", "street_address", "country", "zip", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", ""], ["description", ""], ["street_address", ""], ["country", "India"], ["zip", ""], ["created_at", "2015-02-24 01:17:47.230787"], ["updated_at", "2015-02-24 01:17:47.230787"]]

  def update
    respond_to do |format|
      if params[:commit]=="Approve Event"
        @event.is_approved = true
      end
      if @event.update(event_params)
---
UPDATE "events" SET "is_approved" = ?, "event_type" = ?, "start_time" = ?, "description" = ?, "source" = ?, "businessowner_id" = ?, "updated_at" = ? WHERE "events"."id" = ?